tap 'homebrew/bundle'
tap 'homebrew/core'

if OS.mac?
  #tap 'agiliopadua/extras'
  tap 'homebrew/cask'
  tap 'homebrew/cask-fonts'
  #packages
  brew 'cpanm'
  brew 'gcc'
  brew 'open-mpi'
  brew 'fftw'
  brew 'openblas'
  brew 'scalapack'
  brew 'mas'
  brew 'ffmpeg'
  brew 'graphviz'
  brew 'gnuplot'
  brew 'imagemagick'
  brew 'lftp'
  brew 'nkf'
  brew 'npm'
  brew 'open-babel'
  brew 'poppler' # pdf tool
  brew 'povray'
  brew 'python-tk'
  brew 'xclip'
#  brew 'xpdf'
  brew 'unar'
  brew 'youtube-dl'
  brew 'zsh'
  #brew 'agiliopadua/extras/xcrysden'
  #brew 'imagemagick'
  #brew 'sphinx-doc'
  #brew 'socat'
  #brew 'wkhtmltopdf'
  #brew 'blackhole-16ch'
  #Applications
  #cask 'background-music'
  #cask '1password'
  #cask 'adobe-acrobat-reader'
  #cask 'gimp'
  #cask 'sitesuker-pro'
  cask 'deepl'
  cask 'docker'
  cask 'firefox'
  cask 'font-hack-nerd-font'
  cask 'google-chrome'
  cask 'grammarly'
  cask 'inkscape'
  cask 'iterm2'
  cask 'latexit'
  cask 'mactex-no-gui'
  cask 'mathpix-snipping-tool'
  cask 'papers'
  cask 'Skim'
  cask 'slack'
  cask 'notion'
  cask 'vesta'
  cask 'visual-studio-code'
  cask 'xquartz'
  cask 'zoom'
  mas 'keynote', id: 409183694
  mas 'numbers', id: 409203825
  mas 'pages', id: 409201541
  mas 'GoodNotes 6', id: 1444383602
  mas 'LadioCast', id: 411213048
elsif OS.linux?
  brew 'gcc'
end

#packages
brew 'zsh'
brew 'xclip' # access to clipboard (similar to pbcopy/pbpaste)
brew 'a2ps'
brew 'bat' # better cat
brew 'cmake' # cmake (latest)
brew 'compiledb' # generate compile_commands.json from Makefile
brew 'diff-so-fancy'
brew 'exa'
brew 'fd' # find alternative
brew 'fnm' # Fast Node version manager
brew 'fortran-language-server'
brew 'fzf' # Fuzzy file searcher, used in scripts and in vim
brew 'git' # Git version control (latest version)
brew 'git-delta' # a better git diff
brew 'grep' # grep (latest)
brew 'neovim' # a better vim
brew 'python' # python (latest)
brew 'pyenv' # pyenv (latest)
brew 'rbenv' # ruby version control
brew 'ripgrep' # very fast file searcher
brew 'tmux' # terminal multiplexer
brew 'tree' # pretty-print directory contents
brew 'vim' # Vim (latest)
brew 'yarn'

